In [1]:
import pandas as pd
people = {
    "first": ["Coray", "Jhon", "Jane"],
    "last": ["Schafer", "Doe", "Doe"],
    "e-mail": ["CoraySchafer@gmail.com", "JaneDoe@gmail.com", "JohnDoe@gmail.com"]
}

In [2]:
df = pd.DataFrame(people)
df

   first     last                  e-mail
0  Coray  Schafer  CoraySchafer@gmail.com
1   Jhon      Doe       JaneDoe@gmail.com
2   Jane      Doe       JohnDoe@gmail.com

### Add and Remove Columns

In [3]:
# Add Columns 
df["age"] = [12, 13, 15]

In [4]:
df

   first     last                  e-mail  age
0  Coray  Schafer  CoraySchafer@gmail.com   12
1   Jhon      Doe       JaneDoe@gmail.com   13
2   Jane      Doe       JohnDoe@gmail.com   15

In [5]:
# Combining Columns
df["first"] + " " + df["last"]

0    Coray Schafer
1         Jhon Doe
2         Jane Doe
dtype: object

In [6]:
df

   first     last                  e-mail  age
0  Coray  Schafer  CoraySchafer@gmail.com   12
1   Jhon      Doe       JaneDoe@gmail.com   13
2   Jane      Doe       JohnDoe@gmail.com   15

In [7]:
df["full"] = df["first"] + " " + df["last"]

In [8]:
df

   first     last                  e-mail  age           full
0  Coray  Schafer  CoraySchafer@gmail.com   12  Coray Schafer
1   Jhon      Doe       JaneDoe@gmail.com   13       Jhon Doe
2   Jane      Doe       JohnDoe@gmail.com   15       Jane Doe

In [9]:
# Removing Columns ---> df.drop(columns = [], axis = 1, inplace =....)
df.drop(columns = ["first", "last"], axis = 1) # axis = 1 | axis = 'columns'

                   e-mail  age           full
0  CoraySchafer@gmail.com   12  Coray Schafer
1       JaneDoe@gmail.com   13       Jhon Doe
2       JohnDoe@gmail.com   15       Jane Doe

In [10]:
df

   first     last                  e-mail  age           full
0  Coray  Schafer  CoraySchafer@gmail.com   12  Coray Schafer
1   Jhon      Doe       JaneDoe@gmail.com   13       Jhon Doe
2   Jane      Doe       JohnDoe@gmail.com   15       Jane Doe

In [11]:
df.drop(columns = ["first", "last"], axis = 1, inplace= True)

In [12]:
df

                   e-mail  age           full
0  CoraySchafer@gmail.com   12  Coray Schafer
1       JaneDoe@gmail.com   13       Jhon Doe
2       JohnDoe@gmail.com   15       Jane Doe

In [13]:
df["full"].str.split(" ", expand=True)

       0        1
0  Coray  Schafer
1   Jhon      Doe
2   Jane      Doe

In [14]:
df[["first","last"]] = df["full"].str.split(" ", expand=True)

In [15]:
df

                   e-mail  age           full  first     last
0  CoraySchafer@gmail.com   12  Coray Schafer  Coray  Schafer
1       JaneDoe@gmail.com   13       Jhon Doe   Jhon      Doe
2       JohnDoe@gmail.com   15       Jane Doe   Jane      Doe

### Add and Remove Rows

In [16]:
# Add Single Row
df.append({"first":"Ahmed"})  # --> TypeError: Can only append a dict if ignore_index=True

C:\Users\mr\AppData\Local\Temp\ipykernel_10684\2018633945.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({"first":"Ahmed"})  # --> TypeError: Can only append a dict if ignore_index=True

TypeError: Can only append a dict if ignore_index=True

In [17]:
df.append({"first":"Ahmed"}, ignore_index=True)
# It Will Creates a new DF

C:\Users\mr\AppData\Local\Temp\ipykernel_10684\1422601859.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({"first":"Ahmed"}, ignore_index=True)

                   e-mail   age           full  first     last
0  CoraySchafer@gmail.com  12.0  Coray Schafer  Coray  Schafer
1       JaneDoe@gmail.com  13.0       Jhon Doe   Jhon      Doe
2       JohnDoe@gmail.com  15.0       Jane Doe   Jane      Doe
3                     NaN   NaN            NaN  Ahmed      NaN

In [18]:
df

                   e-mail  age           full  first     last
0  CoraySchafer@gmail.com   12  Coray Schafer  Coray  Schafer
1       JaneDoe@gmail.com   13       Jhon Doe   Jhon      Doe
2       JohnDoe@gmail.com   15       Jane Doe   Jane      Doe

In [19]:
people = {
    "first": ["Tony", "Steve"],
    "last": ["Stark", "Rogers"],
    "e-mail": ["Tony@gmail.com", "Steve@gmail.com"]
}

df2 = pd.DataFrame(people)

In [20]:
df2

   first    last           e-mail
0   Tony   Stark   Tony@gmail.com
1  Steve  Rogers  Steve@gmail.com

In [21]:
# To Add Records of DF2 into DF (With the Same Column names)
df.append(df2, ignore_index=True, sort=True)

C:\Users\mr\AppData\Local\Temp\ipykernel_10684\2819314041.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True, sort=True)

    age                  e-mail  first           full     last
0  12.0  CoraySchafer@gmail.com  Coray  Coray Schafer  Schafer
1  13.0       JaneDoe@gmail.com   Jhon       Jhon Doe      Doe
2  15.0       JohnDoe@gmail.com   Jane       Jane Doe      Doe
3   NaN          Tony@gmail.com   Tony            NaN    Stark
4   NaN         Steve@gmail.com  Steve            NaN   Rogers

In [22]:
df = df.append(df2, ignore_index=True, sort=True)

C:\Users\mr\AppData\Local\Temp\ipykernel_10684\2984770347.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True, sort=True)

In [23]:
df

    age                  e-mail  first           full     last
0  12.0  CoraySchafer@gmail.com  Coray  Coray Schafer  Schafer
1  13.0       JaneDoe@gmail.com   Jhon       Jhon Doe      Doe
2  15.0       JohnDoe@gmail.com   Jane       Jane Doe      Doe
3   NaN          Tony@gmail.com   Tony            NaN    Stark
4   NaN         Steve@gmail.com  Steve            NaN   Rogers

In [24]:
# Remove Rows
df.drop(index= 4,axis= 0)

    age                  e-mail  first           full     last
0  12.0  CoraySchafer@gmail.com  Coray  Coray Schafer  Schafer
1  13.0       JaneDoe@gmail.com   Jhon       Jhon Doe      Doe
2  15.0       JohnDoe@gmail.com   Jane       Jane Doe      Doe
3   NaN          Tony@gmail.com   Tony            NaN    Stark

In [25]:
df

    age                  e-mail  first           full     last
0  12.0  CoraySchafer@gmail.com  Coray  Coray Schafer  Schafer
1  13.0       JaneDoe@gmail.com   Jhon       Jhon Doe      Doe
2  15.0       JohnDoe@gmail.com   Jane       Jane Doe      Doe
3   NaN          Tony@gmail.com   Tony            NaN    Stark
4   NaN         Steve@gmail.com  Steve            NaN   Rogers

In [26]:
df.drop(index=4, axis=0, inplace=True)

In [27]:
df

    age                  e-mail  first           full     last
0  12.0  CoraySchafer@gmail.com  Coray  Coray Schafer  Schafer
1  13.0       JaneDoe@gmail.com   Jhon       Jhon Doe      Doe
2  15.0       JohnDoe@gmail.com   Jane       Jane Doe      Doe
3   NaN          Tony@gmail.com   Tony            NaN    Stark

In [28]:
# Drop Rows by Conditions
filt = df["last"] == "Doe"
df.drop(index = df[filt] .index)

    age                  e-mail  first           full     last
0  12.0  CoraySchafer@gmail.com  Coray  Coray Schafer  Schafer
3   NaN          Tony@gmail.com   Tony            NaN    Stark

### New Ways to Add Rows

In [54]:
people = {
    'Name': ['Alice', 'Bob'],
    'Age': [25, 30]
}
df = pd.DataFrame(people)

In [55]:
df

    Name  Age
0  Alice   25
1    Bob   30

In [56]:
# Add Row -> Using df.loc[len(df)], len(df) -> to append after the last row 
df.loc[len(df)] = ['Charlie', 35]

In [57]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [58]:
df.loc[len(df)] = ['Coray', 32]

In [59]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    Coray   32

In [60]:
# Add Multiple Rows -> Using pd.concat()
people = {
    'Name': ['Eve', 'Frank'],
    'Age': [28, 45]
}
df2 = pd.DataFrame(people)

In [61]:
df2

    Name  Age
0    Eve   28
1  Frank   45

In [52]:
df = pd.concat([df2, df], ignore_index=True)
# [df2, df] -> Insert df2 above df (at the Start)
# [df, df2] -> Insert df2 below df (at the End)

In [53]:
df

      Name  Age
0      Eve   28
1    Frank   45
2    Alice   25
3      Bob   30
4  Charlie   35
5    Coray   32

In [62]:
df = pd.concat([df, df2], ignore_index=True)
# [df2, df] -> Insert df2 above df (at the Start)
# [df, df2] -> Insert df2 below df (at the End)

In [63]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    Coray   32
4      Eve   28
5    Frank   45